# VERİ OKUMA-YAZMA

In [9]:
import pandas as pd

Veriler bir virgül ile ayrılmış ise read_csv , eğer bir tab boşluk ile ayrılmışsa read_table fonksiyonları kullanılır.

In [10]:
df=pd.read_table("veriseti.txt")
df

    name  score gender
0   John     80      M
1  Pearl     85      F
2  James     70      M
3   Nick     90      M
4   Love     75      F

Önerilen yol Jupyter Notebook çalışma dosyamızla verisetinin aynı klasör içinde bulunmasıdır. Eğer farklı bir konumdaysa dosya yolunu girerek okuturuz.

Eğer veriseti farklı bir simge ile ayrılıyorsa sep="" operatörü kullanılır.

In [11]:
df2=pd.read_table("veriseti2.txt",sep=",")
df2

      John  80  M
0    Rigby  90  M
1     Pops  45  M
2   Dennis  60  F
3  Micheal  70  M

Verisetinde bazen sütun adları olmayabilir. Ya da var olan sütun adlarını değiştirebiliriz.

In [21]:
df2=pd.read_table("veriseti2.txt",sep=",",header=None )
df2

         0   1  2
0     John  80  M
1    Rigby  90  M
2     Pops  45  M
3   Dennis  60  F
4  Micheal  70  M

In [20]:
df2=pd.read_table("veriseti2.txt",sep=",",header=None, names=["Name","Score","Gender"])
df2

      Name  Score Gender
0     John     80      M
1    Rigby     90      M
2     Pops     45      M
3   Dennis     60      F
4  Micheal     70      M

Mesela Name sütununu index olarak kullanmak istersek;

In [19]:
df2=pd.read_table("veriseti2.txt",sep=",",header=None, names=["Name","Score","Gender"], index_col="Name")
df2

         Score Gender
Name
John        80      M
Rigby       90      M
Pops        45      M
Dennis      60      F
Micheal     70      M

In [15]:
df3=pd.read_table("veriseti3.txt",sep=",")
df3

   Course     Name  Midterm1  Midterm2
0    Math     John        80        85
1    Math  Micheal        90        70
2    Math    James        70        95
3  Linear     Jonh        65        90
4  Linear  Micheal        85        80
5  Linear    James        55        70

Bu veri setini Course ve Name sütunlarına göre indexlemek istersek;

In [46]:
df3=pd.read_table("veriseti3.txt",sep=",",index_col=["Course","Name"])
df3

                Midterm1  Midterm2
Course Name
Math   John           80        85
       Micheal        90        70
       James          70        95
Linear Jonh           65        90
       Micheal        85        80
       James          55        70

use_col[] methodu ile kullanılacak sütunları , nrows=3 ile gösterilecek satırları belirleyebiliriz.

In [47]:
df3=pd.read_table("veriseti3.txt",sep=",",index_col=["Course","Name"],usecols=[0,1],nrows=3)
df3

Empty DataFrame
Columns: []
Index: [(Math, John), (Math, Micheal), (Math, James)]

İçinde eksik verilerin olduğu bir verisetini okutalım.

In [50]:
df4=pd.read_table("veriseti4.txt",sep=",")
df4

    Name  Puan Gender
0  Allan  80.0    NaN
1   John   NaN   John
2  James  70.0    n.a
3    NaN  90.0      F
4  Ellen  -5.0      F

In [51]:
pd.isnull(df4)

    Name   Puan  Gender
0  False  False    True
1  False   True   False
2  False  False   False
3   True  False   False
4  False  False   False

Puan negatif değer olamaz ve n.a değerinin NaN olduğunu belirtelim. Bunu belirtelim.

In [53]:
df4=pd.read_table("veriseti4.txt",sep=",",na_values=["n.a",-5])
df4

    Name  Puan Gender
0  Allan  80.0    NaN
1   John   NaN   John
2  James  70.0    NaN
3    NaN  90.0      F
4  Ellen   NaN      F

Verisetinde görüldüğü üzere Gender=John değeri geçersiz bir veri onu da düzeltmek istersek; Name sütunundaki John değerinin de kaybolmasını istemediğimiz için şöyle bir yol izleyebiliriz.

In [55]:
eksik_veri={"Puan":[-5],"Gender":["n.a","John"]}
df4=pd.read_table("veriseti4.txt",sep=",",na_values=eksik_veri)
df4

    Name  Puan Gender
0  Allan  80.0    NaN
1   John   NaN    NaN
2  James  70.0    NaN
3    NaN  90.0      F
4  Ellen   NaN      F

Verisetini .csv formatında yazmak için to csv methodunu kullanabiliriz.

In [57]:
df=pd.read_table("veriseti.txt")
df

    name  score gender
0   John     80      M
1  Pearl     85      F
2  James     70      M
3   Nick     90      M
4   Love     75      F

In [60]:
df.to_csv("new_dataset.csv")

Verideki değerleri ayırmak için virgül kullandık fakat farklı bir işaret de kullanmak mümkündür. Bunun için sys modülünü import etmek gerekir.

In [61]:
import sys

In [64]:
df.to_csv(sys.stdout,sep="|",na_rep="NULL")

|name|score|gender
0|John|80|M
1|Pearl|85|F
2|James|70|M
3|Nick|90|M
4|Love|75|F

Veriyi dış kaynağa aktarırken Satır ve Sütun etiketleri de gelir. Bunu engellemek için index=False,header=False kullanılır.

In [65]:
df.to_csv(sys.stdout,sep="|",na_rep="NULL",index=False,header=False)

John|80|M
Pearl|85|F
James|70|M
Nick|90|M
Love|75|F

Yalnızca istediğimiz sütunları yazdırmak da mümkündür.

In [67]:
df.to_csv(sys.stdout,sep="|",na_rep="NULL",index=False,columns=["name","score"])

name|score
John|80
Pearl|85
James|70
Nick|90
Love|75

Konuyu özetlemek gerekirse tab boşluklarıyla ayrılmış veri setlerini read_table virgül ile ayrılmış veri srtlerini read_csv mehtodu kullanılarak içe aktarılabilir.

Eğer bunlardan başka formattaki verisetlerini okutmak istersek; örneğin xls veya xlsx formatındaki veri setlerini içe aktarmak istiyorsak read_excel methodu, virgül olmadan sabit uzunluktaki sütun formatı için fwf methodu, javascript obje formatları için 
json methodu, html dökümanındaki tablolar için read_html formatı kullanılabilir.